import random
from card import card

random.seed()


def set_deck():
    deck = [card(0, "Глупакът", "Глупакът показва период на новости, време, в което животът започва от начало.\n" +
                 "Човек се чувства така сякаш е отново в начална позиция, без значение дали се отнася за\n" +
                 "любовни връзки, кариера, в работата или в интелектуалните занимания.",
                 "Има проблеми със започването на нещо ново, с преместване, с виждането на света през нови очи. " +
                 "Има и усещане за зацикляне, липса на вдъхновение.\n" +
                 "Глупакът стои отстрани на пътя с пришки по краката и камъчета в обувките, неспособен да продължи по пътя си."),
            card(1, "Магьосникът", "Нещата зависят само от инициативата ви в конкретната ситуация. " +
                 "Имате възможност да сте ловки и умели в преговорите, за да постигнете каквото очаквате.\n" +
                 "Нещата са във ваши ръце – преносно и буквално.",
                 "В момента не вярвате в успеха си, нямате необходимите инструменти за целта, случаят не е удобен за вас и т.н.\n" +
                 "Може да говори и за по-неприятен аспект като измамата."),
            card(2, "Върховната жрица",
                 "Тя е пазач, който води човек за ръка през обратите на реалния свят, представя човек с добри намерения.",
                 "Може да бъде намек, или случайно събитие, което се вижда, което ще ни принуди да преразгледаме основите на мирогледа."),
            card(3, "Императрицата",
                 "За жените, императрицата обещава брак, укрепване на съществуващ съюз или намиране на нова любов.\n" +
                 "В зависимост от въпроса, той може да посочи и бременност или финансово благополучие.",
                 "За мъжете императрицата показва силна връзка, намирайки втората си половина или надежден съюзник,\n" +
                 "който е напълно негова страна и е готова да подкрепя винаги и във всичко.\n" +
                 "Във всеки случай ще бъде жена, която ще има голямо влияние върху бъдещия живот."),
            card(4, "Императора",
                 "Не трябва да си свонамерен и прекалено уверен, трябва да засвидетелстваш уважение пред раководител или някой по възвастен.\n" +
                 "Отразава реда и традицията, затова не трябва да се ходи срещу нея.",
                 "Когато императорът е обърнат значи, че има проблем с властта," + " ако е в теб я опускаш, ако е в някой друг, скоро ще стъпи накриво.\n" + "Трябва да премисляш задачите и наредбите върху теб, защото може да изпаднеш в безизходна ситуация."),
            card(6, "Влюбените",
                 "Понякога наистина означава любов, срещане с човека на живота, интимност и т.н., но в повечето случаи на цената на жертва.\n" +
                 "Става дума за период в живота ви, в който сте изправени до края на път, който се разделя в две посоки\n" +
                 "и само от вас зависи по коя от двете ще поемете " +
                 "– към едната ви тегли желанието, към другата дългът или пък страхът от новото и различното.",
                 "Обърнатата карта е най-съгурния признак за мързел. Но също те упоменават, че се страхувате да вземете важен избор."),
            card(7, "Колесницата",
                 "Колесницата често ни насърчава да следваме своя собствен път и да не се разсейваме с чуждите съдби,\n" +
                 "тя ни кара да се фокусираме и да направим, каквото е необходимо, за да постигнем целите си.",
                 "Страх - ще индикира, че в човека има голямо желание за промяна и за вземане на нещта в свои ръце," +
                 " но в момента той няма достатъчната увереност.\n" +
                 "Всяко малко препятствие по пътя е способно да преобърне тази колесница и да го върне отново в изходна позиция."),
            card(8, "Силата",
                 "Ще трябва да си проправяте път с много усилия, дали нещо ще се случи, по-вероятно отговорът да е „не“ или поне не в близкото бъдеще.",
                 "Тя се появява, когато в дълъг период сме търпяли ситуация, която не е била по вкуса ни и сме се примирявали с нея,\n" +
                 "или защото не сме имали друг избор, или защото не сме искали да създаваме скандали и неприятна атмосфера. "),
            card(9, "Отшелникът",
                 "Говори за период от живота ви (рядко е краткотрайна), в който имате необходимост да прекарвате повече време\n" +
                 "насаме със себе си, за да си изясните нещата. Mоже да става дума и за по-дълбоки промени в човека.",
                 "Тя говори за някакъв вътрешен конфликт между това, от което човек си мисли, че има нужда,\n" +
                 "и това, от което действително се нуждае."),
            card(10, "Колелото на съдбата",
                 "Възможно да изникнат неочаквани ситуации и изненади. Всичко, което е извън сферата на очакваното,\n" +
                 "е възможно да се изпречи на пътя ви в този ден, като може да става дума за приятни" +
                 " и същевременно за изключително неприятни преживявания.",
                 "Вече не за цикличност, а направо за зацикляне. Няма никакво развитие и никакъв шанс за изход" +
                 " от ситуацията или ежедневието. \n" +
                 "Тук не говорим за някакви драматични събития, от които не можем да излезем," +
                 " по-скоро е възможно да сме потънали в рутина и скучно ежедневие, от което не се вижда излизане в скоро време,\n" +
                 "но за нещастие, колкото и да се борим срещу това, няма начин да променим ситуацията. "),
            card(11, "Справедливостта",
                 "Упомнава конкретен човек или ни говори за събитие. Тук я няма толкова емоционалната дилема, колкото ни казва,\n" +
                 "че сме навлезли дълбоко в ситуация, в която са преплетени и чувствата на други хора и трябва да се действа бързо.",
                 "При това положение нещата вече са се объркали.  Ще се почувствате излъгани," +
                 " и предадени и вероятно ще ви е трудно да простите."),
            card(12, "Обесеният",
                 "Погледнете нещата от нова, по-различна гледна точка, защото от мястото, в което ги гледате в момента,\n" +
                 "e твърде вероятно да се изживявате като жертвата в ситуацията.",
                 "Опитвате да се наложите в една ситуация, в която няма как да излезете победител, чувствате се като жертва.\n" +
                 "Не можем да променим събитията, които са ни се случили или ще се случват, но можем да изберем как да реагираме на тях."),
            card(13, "Смъртта",
                 "Всичко ще приключи много по-бързо и безболезнено, но със сигурност ще се случи нещо лошо.\n" +
                 "Показва също че трябва да погледнеш от друг ъгъл.",
                 "Идва процес на изчистване от старите влияния, но вие не желаете да го приемете и се опитвате да продължавате по стария начин."),
            card(14, "Умереността", "Умереността е смесване на две коренно различни неща, за да се получи трето.",
                 "Тя е сигнал, че обединението е започнало да се пропуква. Едно от значенията на обърната карта\n" +
                 "в такъв смисъл е началото на края на един съюз, от друга страна може да е сигнал за период на нехармонични отношения."),
            card(15, "Дяволът",
                 "Попаднали сте в неприятна ситуация, в която нещо материално ви задържа привързани, а вие просто не можете да видите изход от нея.\n" +
                 "Дяволът винаги дава, преди да вземе, но когато вземе, иска то да е завинаги. Материалното, към което е привикнал – пари, удобства, секс, власт.",
                 "Човекът вече осъзнава проблема и търси начин да го преодолее. Така картата те подтиква да действаш."),
            card(16, "Кулата",
                 "Картата е видимо разрушителна. Всички тези новини ще дойдат буквално като гръм от ясно небе и ще предизвикат обрат.",
                 "Картата предвещава разруха на психиката, след нея се пораждат много изначанли въпроси.\n" +
                 "Новините ще дойдат по-плавно ,но е почти сигурно, че няма да се добри."),
            card(17, "Звездата",
                 "Звездата може да означава и лечебна сила, излекуване, както във физическия смисъл на думата, така и що се отнася до лекуване\n" +
                 "на стари рани в душата. Понякога показва, че помощта може да дойде отвън и то скоро.",
                 "Символизира грешен път, по който сме поели или пък се фокусираме прекалено много в бъдещето и забравяме да бъдем," +
                 " тук и сега. Ще си останеш само с каненето"),
            card(18, "Луната",
                 "Не виждате нещата в истинската им светлина и се заблуждавате в нещо или някого. Не е добро време за вземане на решения,\n" +
                 "за захващане за нов проект освен, ако той е творчески.",
                 "Започват да ви играят със съзнанието всякакви паранои, страхове от различни неща и да си вкарвате сами " +
                 "в главата невероятни драми."),
            card(19, "Слънцето", "Слънцето внася необходимата доза логика и рационалнос в главата ни.\n" +
                 "Освен това Слънцето може да предвещава, че ще се превърнем в център на внимание в дадена ситуация.\n" +
                 "Винаги обузначава нещо хувабо, което ще ни зарадва без да е задължително тода е върху нас.",
                 "Обърнатата позиция може да ни сигнализира, че прекаляваме с нещо, а много хубаво не е на хубаво.\n" +
                 "Както нещо изначално позитивно, може и да е нещо лошо, което ни кара да се чувстваме щастлижи."),
            card(20, "Страшният съд",
                 "Това може да е пробуждане, знак от съдбата или от приятел, който да ни отрезви и да ни покаже, че не се движим по пътя си.\n" +
                 "Най-основното значение на картата е трансформация и то на доста дълбоко ниво.\n" +
                 "Трябва да простим, да забравим и да продължим напред. Трябва да оставим всичко старо, за да можем да се освободим и да продължим.",
                 "Просто трансформацията се случва по-бавно или е блокирана. Преструваме, че не го чуваме, правим се на разсеяни и си казваме," +
                 "че нещата може и да се променят за в бъдеще."),
            card(21, "Светът",
                 "В повечето случаи картата има положителни краски. Тя бележи край на етап от живота ни, но той не е толкова драматичен и насилствен,\n" +
                 "напротив, научили сме, каквото е трябвало, а сега ни се дава възможност да продължим, използвайки натрупания потенциал.",
                 "При обърнатата карта обикновено се сблъскваме със ситуации, в които не се чувстваме комфортно в собствената си кожа,\n" +
                 "а това най-често води до чувство на самота, макар и сред тълпа от хора.")]
    return deck


# change for git

def print_info():
    print()
    print("Лист от команди:")
    print("e - една карта")
    print("d - дневно теглене")
    print("w - седмично теглене")
    print("m - месечно теглене")
    print("sh - разбъркване")
    print("info - информация")
    print("stop - край на програмата")
    print()


def draw_hand(deck, num):
    if len(deck) > num:
        indexes, hand = [i for i in range(len(deck))], list()
        for i in range(num):
            index = random.randint(0, len(indexes) - 1)
            hand.append(deck[index])
            del indexes[index]
            del deck[index]
        print()
        return hand
    else:
        deck = refill(deck)

        indexes, hand = [i for i in range(len(deck))], list()
        for i in range(num):
            index = random.randrange(0, len(indexes))
            hand.append(deck[index])
            del indexes[index]
            del deck[index]
        print()
        return hand


def refill(deck):
    deck.clear()
    print("Deck is empty!")
    print("Refiling.......")
    print("READY")
    deck = set_deck()
    shuffle(deck, 1)
    return deck


def see_cards(hand):
    while len(hand) != 0:
        ur_card = hand[0]
        del hand[0]
        if ur_card.id_card == 3:
            print(ur_card.id_card, '. ', ur_card.name)
            print("Жена:", ur_card.description_up)
            print("Жена:", ur_card.description_down)
        else:
            print(str(ur_card.id_card) + ". " + ur_card.name + " -> " + ur_card.poss)
            if ur_card.poss == "up":
                print(ur_card.description_up)
            else:
                print(ur_card.description_down)


def main():
    print_info()
    deck: list = set_deck()
    hand: list
    # cmd = None

    shuffle(deck, 1)
    while True:
        cmd = input("Команда:")
        if cmd == 'sh':  # shuffle deck n-times
            times = input("Въведи брой пъти за разбъркване на тестето: ")
            shuffle(deck, times)
        elif cmd == 'e':  # single check
            hand = draw_hand(deck, 1)
            see_cards(hand)
        elif cmd == 'd':  # daily check
            hand = draw_hand(deck, 2)
            see_cards(hand)
        elif cmd == 'w':  # weekly check
            hand = draw_hand(deck, 4)
            see_cards(hand)
        elif cmd == 'm':  # monthly check
            hand = draw_hand(deck, 6)
            see_cards(hand)

        elif cmd == 'again':
            deck: list = set_deck()
        elif cmd == 'info':  # single check
            print_info()
        elif cmd == 'stop':  # single check
            break
        else:
            print('Невярна команда')


def shuffle(deck, times):
    for i in range(int(times)):
        random.shuffle(deck)
        for card_t in deck:
            poss = random.randint(0, 1)
            if poss == 1:
                card_t.poss = 'up'
            else:
                card_t.poss = 'down'


if __name__ == '__main__':
    main()
